# Task 1. Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
#
# def div(arg1, arg2):
#     try:
#         res = round(arg1 / arg2, 2)
#     except ZeroDivisionError:
#         return "Деление на 0"
#     return res
# print(f'Результат {div(int(input("Первый аргумент ")), int(input("Второй аргумент ")))}')
#


# Task 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя: имя, фамилия,
# год рождения, город проживания, email, телефон. Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.

# def my_func(name, surname, year, city, email, telephone):
#     return ', '.join([name, surname, year, city, email, telephone])
#
# print(my_func(surname='Ivanov', name='Ivan', year='1980', city='Murmansk', email='test@gmail.com',
#               telephone='8-991-565-55-60'))


# Task 3. Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму
# наибольших двух аргументов.

# def my_func(arg1 , arg2, arg3):
#     return arg1 + arg2 + arg3 - min(arg1, arg2, arg3)
# print(f'Result - {my_func(int(input("enter first argument ")), int(input("enter second argument ")), int(input("enter third argument ")))}')


#
# Task 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.



# # первый
#
# def my_func(x, y):
#     return x ** y
# print(f'Результат {my_func(int(input("Первый аргумент ")), int(input("Второй аргумент ")))}')


# # второй
# def my_func(x, y):
#     for i in range(abs(y - 1)):
#         x *= x
#     return 1 / x
# print(f'Результат {my_func(int(input("Первый аргумент ")), int(input("Второй аргумент ")))}')


# Task 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться
# сумма чисел. Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме. Но если вместо числа вводится специальный
# символ, выполнение программы завершается. Если специальный символ введен после нескольких чисел, то вначале нужно
# добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.


# def my_func():
#     var = 0
#     while True:
#         numbers = input('Введите строку чисел или "q" для выхода : ').split()
#         for i in numbers:
#                 if i == 'q':
#                     print(f'Сумма чисел {var}.')
#                     return
#                 else:
#                     var += int(i)
#         print(f'Сумма равна {var}')
# my_func()



#
# Task 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки,
# но каждое слово должно начинаться с заглавной буквы. Необходимо использовать написанную ранее функцию int_func().

# def my_func(text):
#     str = []
#     for i in range(len(text)):
#         str.append(text[i].title())
#     return ' '.join(str)
#
# print(my_func(input('Введите текст : ').split()))